# Pandas

Data manipulation and analysis. 

* csv, database, json, etc.

In [1]:
import pandas as pd
#create a dataframe (from a dictionary)
#creating key-value pairs
dictionary = {"Restaurant":["HABITAT COFFEE SHOP","REILLY'S"],
              "Location":["Milan","Los Angeles"]}

print(dictionary)

{'Restaurant': ['HABITAT COFFEE SHOP', "REILLY'S"], 'Location': ['Milan', 'Los Angeles']}

### DataFrame
Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns)

In [2]:
ranrest = pd.DataFrame(dictionary)

In [3]:
ranrest

            Restaurant     Location
0  HABITAT COFFEE SHOP        Milan
1             REILLY'S  Los Angeles

In [4]:
ranrest.index = ["HCS","RS"]
ranrest

              Restaurant     Location
HCS  HABITAT COFFEE SHOP        Milan
RS              REILLY'S  Los Angeles

In [5]:
#not efficient!
#build importing from csv!

## Importing a dataframe

In [6]:
import pandas as pd
df = pd.read_csv("randomrestaurants.csv", sep = ";",index_col = 0) #try to set: index_col = 0

#filepath_or_buffer : str, path object or file-like object
#   Any valid string path is acceptable. The string could be a URL.
#
#sep : str, default ‘,’
#   Delimiter to use.
#
#delimiter : str, default None
#   Alias for sep.
#
#header : int, list of int, default ‘infer’
#   Row number(s) to use as the column name
#   Default behavior is to infer the column names: 
#
#names : array-like, optional
#   List of column names to use.
#
#index_col : int, str, sequence of int / str, or False, default None
#   Column(s) to use as the row labels of the DataFrame

In [7]:
df

              Restaurant     Location  Score
HCS  HABITAT COFFEE SHOP        Milan     95
RS              REILLY'S  Los Angeles     91
SC        STREET CHURROS     New York     90
RGC  RIO GENTLEMANS CLUB         Rome     96
LPQ    LE PAIN QUOTIDIEN       Berlin     89
TEP    TRINITI ECHO PARK       Madrid     99
MMM  MARCE'S MINI MARKET    Cape Town     93
P                 POLLEN       Ottawa     94
TSG       THE SPOT GRILL      Toronto     97

In [8]:
print(help(pd.read_csv))

Help on function read_csv in module pandas.io.parsers.readers:

read_csv(filepath_or_buffer: 'FilePathOrBuffer', sep=<no_default>, delimiter=None, header='infer', names=<no_default>, index_col=None, usecols=None, squeeze=False, prefix=<no_default>, mangle_dupe_cols=True, dtype: 'DtypeArg | None' = None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal: 'str' = '.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, encoding_errors: 'str | None' = 'strict', dialect=None, error_bad_lines=None, warn_bad_lines=None, on_bad_lines=None, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None, storage_options: 'StorageOptions' = None)
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts any ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Delimiter to use. If sep is None, the C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator by Python's builtin sniffer
        tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
        different from ``'\s+'`` will be interpreted as regular expressions and
        will also force the use of the Python parsing engine. Note that regex
        delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, default ``None``
        Alias for sep.
    header : int, list of int, default 'infer'
        Row number(s) to use as the column names, and the start of the
        data.  Default behavior is to infer the column names: if no names
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a multi-index on the columns
        e.g. [0,1,3]. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.
    names : array-like, optional
        List of column names to use. If the file contains a header row,
        then you should explicitly pass ``header=0`` to override the column names.
        Duplicates in this list are not allowed.
    index_col : int, str, sequence of int / str, or False, default ``None``
      Column(s) to use as the row labels of the ``DataFrame``, either given as
      string name or column index. If a sequence of int / str is given, a
      MultiIndex is used.

      Note: ``index_col=False`` can be used to force pandas to *not* use the first
      column as the index, e.g. when you have a malformed file with delimiters at
      the end of each line.
    usecols : list-like or callable, optional
        Return a subset of the columns. If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in `names` or
        inferred from the document header row(s). For example, a valid list-like
        `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a DataFrame from ``data`` with element order preserved use
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
        in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to True. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    squeeze : bool, default False
        If the parsed data only contains one column then return a Series.
    prefix : str, optional
        Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...
    mangle_dupe_cols : bool, default True
        Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
        'X'...'X'. Passing in False will cause data to be overwritten if there
        are duplicate names in the columns.
    dtype : Type name or dict of column -> type, optional
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
        'c': 'Int64'}
        Use `str` or `object` together with suitable `na_values` settings
        to preserve and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.
    engine : {'c', 'python'}, optional
        Parser engine to use. The C engine is faster while the python engine is
        currently more feature-complete.
    converters : dict, optional
        Dict of functions for converting values in certain columns. Keys can either
        be integers or column labels.
    true_values : list, optional
        Values to consider as True.
    false_values : list, optional
        Values to consider as False.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : list-like, int or callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (int)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning True if the row should be skipped and False otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with engine='c').
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
    na_values : scalar, str, list-like, or dict, optional
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values.  By default the following values are interpreted as
        NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'n/a',
        'nan', 'null'.
    keep_default_na : bool, default True
        Whether or not to include the default NaN values when parsing the data.
        Depending on whether `na_values` is passed in, the behavior is as follows:

        * If `keep_default_na` is True, and `na_values` are specified, `na_values`
          is appended to the default NaN values used for parsing.
        * If `keep_default_na` is True, and `na_values` are not specified, only
          the default NaN values are used for parsing.
        * If `keep_default_na` is False, and `na_values` are specified, only
          the NaN values specified `na_values` are used for parsing.
        * If `keep_default_na` is False, and `na_values` are not specified, no
          strings will be parsed as NaN.

        Note that if `na_filter` is passed in as False, the `keep_default_na` and
        `na_values` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing na_filter=False can improve the performance
        of reading a large file.
    verbose : bool, default False
        Indicate number of NA values placed in non-numeric columns.
    skip_blank_lines : bool, default True
        If True, skip over blank lines rather than interpreting as NaN values.
    parse_dates : bool or list of int or names or list of lists or dict, default False
        The behavior is as follows:

        * boolean. If True -> try parsing the index.
        * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
          result 'foo'

        If a column or index cannot be represented as an array of datetimes,
        say because of an unparsable value or a mixture of timezones, the column
        or index will be returned unaltered as an object data type. For
        non-standard datetime parsing, use ``pd.to_datetime`` after
        ``pd.read_csv``. To parse an index or column with a mixture of timezones,
        specify ``date_parser`` to be a partially-applied
        :func:`pandas.to_datetime` with ``utc=True``. See
        :ref:`io.csv.mixed_timezones` for more.

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : bool, default False
        If True and `parse_dates` is enabled, pandas will attempt to infer the
        format of the datetime strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.
    keep_date_col : bool, default False
        If True and `parse_dates` specifies combining multiple columns then
        keep the original columns.
    date_parser : function, optional
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    cache_dates : bool, default True
        If True, use a cache of unique, converted dates to apply the datetime
        conversion. May produce significant speed-up when parsing duplicate
        date strings, especially ones with timezone offsets.

        .. versionadded:: 0.25.0
    iterator : bool, default False
        Return TextFileReader object for iteration or getting chunks with
        ``get_chunk()``.

        .. versionchanged:: 1.2

           ``TextFileReader`` is a context manager.
    chunksize : int, optional
        Return TextFileReader object for iteration.
        See the `IO Tools docs
        <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.

        .. versionchanged:: 1.2

           ``TextFileReader`` is a context manager.
    compression : {'infer', 'gzip', 'bz2', 'zip', 'xz', None}, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and
        `filepath_or_buffer` is path-like, then detect compression from the
        following extensions: '.gz', '.bz2', '.zip', or '.xz' (otherwise no
        decompression). If using 'zip', the ZIP file must contain only one data
        file to be read in. Set to None for no decompression.
    thousands : str, optional
        Thousands separator.
    decimal : str, default '.'
        Character to recognize as decimal point (e.g. use ',' for European data).
    lineterminator : str (length 1), optional
        Character to break file into lines. Only valid with C parser.
    quotechar : str (length 1), optional
        The character used to denote the start and end of a quoted item. Quoted
        items can include the delimiter and it will be ignored.
    quoting : int or csv.QUOTE_* instance, default 0
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
        QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
    doublequote : bool, default ``True``
       When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive quotechar elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        One-character string used to escape other characters.
    comment : str, optional
        Indicates remainder of line should not be parsed. If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter `header` but not by
        `skiprows`. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
        treated as the header.
    encoding : str, optional
        Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .

        .. versionchanged:: 1.2

           When ``encoding`` is ``None``, ``errors="replace"`` is passed to
           ``open()``. Otherwise, ``errors="strict"`` is passed to ``open()``.
           This behavior was previously only the case for ``engine="python"``.

        .. versionchanged:: 1.3.0

           ``encoding_errors`` is a new argument. ``encoding`` has no longer an
           influence on how encoding errors are handled.

    encoding_errors : str, optional, default "strict"
        How encoding errors are treated. `List of possible values
        <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

        .. versionadded:: 1.3.0

    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: `delimiter`, `doublequote`, `escapechar`,
        `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
        override values, a ParserWarning will be issued. See csv.Dialect
        documentation for more details.
    error_bad_lines : bool, default ``None``
        Lines with too many fields (e.g. a csv line with too many commas) will by
        default cause an exception to be raised, and no DataFrame will be returned.
        If False, then these "bad lines" will be dropped from the DataFrame that is
        returned.

        .. deprecated:: 1.3.0
           The ``on_bad_lines`` parameter should be used instead to specify behavior upon
           encountering a bad line instead.
    warn_bad_lines : bool, default ``None``
        If error_bad_lines is False, and warn_bad_lines is True, a warning for each
        "bad line" will be output.

        .. deprecated:: 1.3.0
           The ``on_bad_lines`` parameter should be used instead to specify behavior upon
           encountering a bad line instead.
    on_bad_lines : {'error', 'warn', 'skip'}, default 'error'
        Specifies what to do upon encountering a bad line (a line with too many fields).
        Allowed values are :

            - 'error', raise an Exception when a bad line is encountered.
            - 'warn', raise a warning when a bad line is encountered and skip that line.
            - 'skip', skip bad lines without raising or warning when they are encountered.

        .. versionadded:: 1.3.0

    delim_whitespace : bool, default False
        Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
        used as the sep. Equivalent to setting ``sep='\s+'``. If this option
        is set to True, nothing should be passed in for the ``delimiter``
        parameter.
    low_memory : bool, default True
        Internally process the file in chunks, resulting in lower memory use
        while parsing, but possibly mixed type inference.  To ensure no mixed
        types either set False, or specify the type with the `dtype` parameter.
        Note that the entire file is read into a single DataFrame regardless,
        use the `chunksize` or `iterator` parameter to return the data in chunks.
        (Only valid with C parser).
    memory_map : bool, default False
        If a filepath is provided for `filepath_or_buffer`, map the file object
        directly onto memory and access the data directly from there. Using this
        option can improve performance because there is no longer any I/O overhead.
    float_precision : str, optional
        Specifies which converter the C engine should use for floating-point
        values. The options are ``None`` or 'high' for the ordinary converter,
        'legacy' for the original lower precision pandas converter, and
        'round_trip' for the round-trip converter.

        .. versionchanged:: 1.2

    storage_options : dict, optional
        Extra options that make sense for a particular storage connection, e.g.
        host, port, username, password, etc. For HTTP(S) URLs the key-value pairs
        are forwarded to ``urllib`` as header options. For other URLs (e.g.
        starting with "s3://", and "gcs://") the key-value pairs are forwarded to
        ``fsspec``. Please see ``fsspec`` and ``urllib`` for more details.

        .. versionadded:: 1.2

    Returns
    -------
    DataFrame or TextParser
        A comma-separated values (csv) file is returned as two-dimensional
        data structure with labeled axes.

    See Also
    --------
    DataFrame.to_csv : Write DataFrame to a comma-separated values (csv) file.
    read_csv : Read a comma-separated values (csv) file into DataFrame.
    read_fwf : Read a table of fixed-width formatted lines into DataFrame.

    Examples
    --------
    >>> pd.read_csv('data.csv')  # doctest: +SKIP

None

In [9]:
df.sample(3)

              Restaurant     Location  Score
P                 POLLEN       Ottawa     94
MMM  MARCE'S MINI MARKET    Cape Town     93
RS              REILLY'S  Los Angeles     91

In [10]:
#a further example of importing a dataset
import pandas as pd
df2 = pd.read_csv("glass.csv")
#try to set: index_col=0
df2.head(2)

'''
RI: refractive index
Na: Sodium (unit measurement: weight percent in corresponding oxide, as are attributes 4-10)
Mg: Magnesium
Al: Aluminum
Si: Silicon
K: Potassium
Ca: Calcium
Ba: Barium
Fe: Iron
Type of glass: (class attribute) 
'''

df2.head(2)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Type
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0     1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0     1

## Index and select data

three options:
1. using square brackets
2. loc
3. iloc

In [11]:
#square brackets
import pandas as pd
restaurants = pd.read_csv("randomrestaurants.csv", sep = ";",index_col=0)

restaurants

              Restaurant     Location  Score
HCS  HABITAT COFFEE SHOP        Milan     95
RS              REILLY'S  Los Angeles     91
SC        STREET CHURROS     New York     90
RGC  RIO GENTLEMANS CLUB         Rome     96
LPQ    LE PAIN QUOTIDIEN       Berlin     89
TEP    TRINITI ECHO PARK       Madrid     99
MMM  MARCE'S MINI MARKET    Cape Town     93
P                 POLLEN       Ottawa     94
TSG       THE SPOT GRILL      Toronto     97

In [12]:
restaurants["Location"] #panda series (1d labelled array)
#type(restaurants["Location"])

HCS          Milan
RS     Los Angeles
SC        New York
RGC           Rome
LPQ         Berlin
TEP         Madrid
MMM      Cape Town
P           Ottawa
TSG        Toronto
Name: Location, dtype: object

In [13]:
restaurants[["Location","Score"]]# data frame
#type(restaurants[["Location"]])

        Location  Score
HCS        Milan     95
RS   Los Angeles     91
SC      New York     90
RGC         Rome     96
LPQ       Berlin     89
TEP       Madrid     99
MMM    Cape Town     93
P         Ottawa     94
TSG      Toronto     97

In [14]:
restaurants[["Location","Score"]] #select columns

        Location  Score
HCS        Milan     95
RS   Los Angeles     91
SC      New York     90
RGC         Rome     96
LPQ       Berlin     89
TEP       Madrid     99
MMM    Cape Town     93
P         Ottawa     94
TSG      Toronto     97

In [15]:
#select rows
restaurants[1:4] # three rows in position [1,2,3]

              Restaurant     Location  Score
RS              REILLY'S  Los Angeles     91
SC        STREET CHURROS     New York     90
RGC  RIO GENTLEMANS CLUB         Rome     96

In [16]:
#WHAT IF i want to select columns and rows as 2D numpy array

#you can use:
#1) loc (based on labels)
#2) iloc (position based)

restaurants.loc["RS"]#as pandas series

Restaurant       REILLY'S
Location      Los Angeles
Score                  91
Name: RS, dtype: object

In [17]:
restaurants.loc[["RS"]]

   Restaurant     Location  Score
RS   REILLY'S  Los Angeles     91

In [18]:
restaurants.loc[["HCS","RS","LPQ"]]

              Restaurant     Location  Score
HCS  HABITAT COFFEE SHOP        Milan     95
RS              REILLY'S  Los Angeles     91
LPQ    LE PAIN QUOTIDIEN       Berlin     89

In [19]:
#extend selecting columns
restaurants.loc[["HCS","RS","LPQ"],["Location","Score"]]

        Location  Score
HCS        Milan     95
RS   Los Angeles     91
LPQ       Berlin     89

In [20]:
restaurants.loc[:,["Location","Score"]] #all rows

        Location  Score
HCS        Milan     95
RS   Los Angeles     91
SC      New York     90
RGC         Rome     96
LPQ       Berlin     89
TEP       Madrid     99
MMM    Cape Town     93
P         Ottawa     94
TSG      Toronto     97

In [21]:
#iloc based on positions
restaurants.iloc[[1]]

   Restaurant     Location  Score
RS   REILLY'S  Los Angeles     91

In [22]:
restaurants.iloc[[1,2,3]]

              Restaurant     Location  Score
RS              REILLY'S  Los Angeles     91
SC        STREET CHURROS     New York     90
RGC  RIO GENTLEMANS CLUB         Rome     96

In [23]:
restaurants.iloc[[1,2,3],[1,2]]

        Location  Score
RS   Los Angeles     91
SC      New York     90
RGC         Rome     96

In [24]:
restaurants.iloc[:,[1,2]]

        Location  Score
HCS        Milan     95
RS   Los Angeles     91
SC      New York     90
RGC         Rome     96
LPQ       Berlin     89
TEP       Madrid     99
MMM    Cape Town     93
P         Ottawa     94
TSG      Toronto     97

In [25]:
restaurants.iloc[:5,[1,2]]

        Location  Score
HCS        Milan     95
RS   Los Angeles     91
SC      New York     90
RGC         Rome     96
LPQ       Berlin     89

In [26]:
#IMPORTING as NUMPY (only with numerical datasets)
import numpy as np
filename = "glass.csv"
data = np.loadtxt(filename, delimiter=",", skiprows=1)#usecols=[0,2]
data

array([[ 1.52101, 13.64   ,  4.49   , ...,  0.     ,  0.     ,  1.     ],
       [ 1.51761, 13.89   ,  3.6    , ...,  0.     ,  0.     ,  1.     ],
       [ 1.51618, 13.53   ,  3.55   , ...,  0.     ,  0.     ,  1.     ],
       ...,
       [ 1.52065, 14.36   ,  0.     , ...,  1.64   ,  0.     ,  7.     ],
       [ 1.51651, 14.38   ,  0.     , ...,  1.57   ,  0.     ,  7.     ],
       [ 1.51711, 14.23   ,  0.     , ...,  1.67   ,  0.     ,  7.     ]])

## Looping on DataFrames

In [27]:
restaurants

              Restaurant     Location  Score
HCS  HABITAT COFFEE SHOP        Milan     95
RS              REILLY'S  Los Angeles     91
SC        STREET CHURROS     New York     90
RGC  RIO GENTLEMANS CLUB         Rome     96
LPQ    LE PAIN QUOTIDIEN       Berlin     89
TEP    TRINITI ECHO PARK       Madrid     99
MMM  MARCE'S MINI MARKET    Cape Town     93
P                 POLLEN       Ottawa     94
TSG       THE SPOT GRILL      Toronto     97

In [28]:
for i in restaurants:
    print(i) #!!! just the columns names

Restaurant
Location
Score

In [29]:
restaurants.iterrows()

In [32]:
for label, row in restaurants.iterrows():
    print(label,":",row)

HCS : Restaurant    HABITAT COFFEE SHOP
Location                    Milan
Score                          95
Name: HCS, dtype: object
RS : Restaurant       REILLY'S
Location      Los Angeles
Score                  91
Name: RS, dtype: object
SC : Restaurant    STREET CHURROS
Location            New York
Score                     90
Name: SC, dtype: object
RGC : Restaurant    RIO GENTLEMANS CLUB
Location                     Rome
Score                          96
Name: RGC, dtype: object
LPQ : Restaurant    LE PAIN QUOTIDIEN
Location                 Berlin
Score                        89
Name: LPQ, dtype: object
TEP : Restaurant    TRINITI ECHO PARK
Location                 Madrid
Score                        99
Name: TEP, dtype: object
MMM : Restaurant    MARCE'S MINI MARKET
Location                Cape Town
Score                          93
Name: MMM, dtype: object
P : Restaurant    POLLEN
Location      Ottawa
Score             94
Name: P, dtype: object
TSG : Restaurant    THE SPOT GRILL
Location             Toronto
Score                     97
Name: TSG, dtype: object

In [33]:
# "row" values can be accessed just like for the dataframe

for label, row in restaurants.iterrows():
    print(label+": "+row["Restaurant"])#+" "+row[("Score")])

HCS: HABITAT COFFEE SHOP
RS: REILLY'S
SC: STREET CHURROS
RGC: RIO GENTLEMANS CLUB
LPQ: LE PAIN QUOTIDIEN
TEP: TRINITI ECHO PARK
MMM: MARCE'S MINI MARKET
P: POLLEN
TSG: THE SPOT GRILL

## Column manipulation

In [34]:
# adding a column while iterating
for label, row in restaurants.iterrows():
    restaurants.loc[label,"name_len"] = int(len(row["Restaurant"]))

restaurants

              Restaurant     Location  Score  name_len
HCS  HABITAT COFFEE SHOP        Milan     95      19.0
RS              REILLY'S  Los Angeles     91       8.0
SC        STREET CHURROS     New York     90      14.0
RGC  RIO GENTLEMANS CLUB         Rome     96      19.0
LPQ    LE PAIN QUOTIDIEN       Berlin     89      17.0
TEP    TRINITI ECHO PARK       Madrid     99      17.0
MMM  MARCE'S MINI MARKET    Cape Town     93      19.0
P                 POLLEN       Ottawa     94       6.0
TSG       THE SPOT GRILL      Toronto     97      14.0

In [35]:
#or use a more efficient apply **instead of a for loop**
restaurants["name_len2"] = restaurants["Restaurant"].apply(len)

restaurants

              Restaurant     Location  Score  name_len  name_len2
HCS  HABITAT COFFEE SHOP        Milan     95      19.0         19
RS              REILLY'S  Los Angeles     91       8.0          8
SC        STREET CHURROS     New York     90      14.0         14
RGC  RIO GENTLEMANS CLUB         Rome     96      19.0         19
LPQ    LE PAIN QUOTIDIEN       Berlin     89      17.0         17
TEP    TRINITI ECHO PARK       Madrid     99      17.0         17
MMM  MARCE'S MINI MARKET    Cape Town     93      19.0         19
P                 POLLEN       Ottawa     94       6.0          6
TSG       THE SPOT GRILL      Toronto     97      14.0         14

In [36]:
# it also work with user defined functions
def rest_class(score):
    if score>95:
        return "A"
    return "B"


# using rest_class function
restaurants["class1"] = restaurants["Score"].apply(rest_class)

restaurants

              Restaurant     Location  Score  name_len  name_len2 class1
HCS  HABITAT COFFEE SHOP        Milan     95      19.0         19      B
RS              REILLY'S  Los Angeles     91       8.0          8      B
SC        STREET CHURROS     New York     90      14.0         14      B
RGC  RIO GENTLEMANS CLUB         Rome     96      19.0         19      A
LPQ    LE PAIN QUOTIDIEN       Berlin     89      17.0         17      B
TEP    TRINITI ECHO PARK       Madrid     99      17.0         17      A
MMM  MARCE'S MINI MARKET    Cape Town     93      19.0         19      B
P                 POLLEN       Ottawa     94       6.0          6      B
TSG       THE SPOT GRILL      Toronto     97      14.0         14      A

### Lambda: Anonymous functions

In [37]:
#using lambdas

restaurants["class2"] = restaurants["Score"].apply(lambda x: "A" if (x>95) else "B")

restaurants

,Restaurant,Location,Score,name_len,name_len2,class1,class2
HCS,HABITAT COFFEE SHOP,Milan,95,19.0,19,B,B
RS,REILLY'S,Los Angeles,91,8.0,8,B,B
SC,STREET CHURROS,New York,90,14.0,14,B,B
RGC,RIO GENTLEMANS CLUB,Rome,96,19.0,19,A,A
LPQ,LE PAIN QUOTIDIEN,Berlin,89,17.0,17,B,B
TEP,TRINITI ECHO PARK,Madrid,99,17.0,17,A,A
MMM,MARCE'S MINI MARKET,Cape Town,93,19.0,19,B,B
P,POLLEN,Ottawa,94,6.0,6,B,B
TSG,THE SPOT GRILL,Toronto,97,14.0,14,A,A

### Apply functions with multiple arguments

In [52]:
def power(score, exponent):
    return score**exponent

restaurants["scoresq1"] = restaurants["Score"]**2
# Note1: column must be the first argument of the function
# Note2: (2,): single element tuples need a trailing comma
restaurants["scoresq2"] = restaurants["Score"].apply(power, args=(2,))
restaurants

,Restaurant,Location,Score,name_len,name_len2,class1,class2,scoresq1,scoresq2
HCS,HABITAT COFFEE SHOP,Milan,95,19.0,19,B,B,9025,9025
RS,REILLY'S,Los Angeles,91,8.0,8,B,B,8281,8281
SC,STREET CHURROS,New York,90,14.0,14,B,B,8100,8100
RGC,RIO GENTLEMANS CLUB,Rome,96,19.0,19,A,A,9216,9216
LPQ,LE PAIN QUOTIDIEN,Berlin,89,17.0,17,B,B,7921,7921
TEP,TRINITI ECHO PARK,Madrid,99,17.0,17,A,A,9801,9801
MMM,MARCE'S MINI MARKET,Cape Town,93,19.0,19,B,B,8649,8649
P,POLLEN,Ottawa,94,6.0,6,B,B,8836,8836
TSG,THE SPOT GRILL,Toronto,97,14.0,14,A,A,9409,9409

In [56]:
## Apply the same function to multiple columns

restaurants[["name_len2sq2","scoresq2"]] = restaurants[["name_len2","Score"]].apply(power, args=(2,))
restaurants

# Note: [[ ]] hints at the fact that we can apply a function to the entire dataset by omitting the columns

,Restaurant,Location,Score,name_len,name_len2,class1,class2,scoresq1,scoresq2,name_len2sq2
HCS,HABITAT COFFEE SHOP,Milan,95,19.0,19,B,B,9025,9025,361
RS,REILLY'S,Los Angeles,91,8.0,8,B,B,8281,8281,64
SC,STREET CHURROS,New York,90,14.0,14,B,B,8100,8100,196
RGC,RIO GENTLEMANS CLUB,Rome,96,19.0,19,A,A,9216,9216,361
LPQ,LE PAIN QUOTIDIEN,Berlin,89,17.0,17,B,B,7921,7921,289
TEP,TRINITI ECHO PARK,Madrid,99,17.0,17,A,A,9801,9801,289
MMM,MARCE'S MINI MARKET,Cape Town,93,19.0,19,B,B,8649,8649,361
P,POLLEN,Ottawa,94,6.0,6,B,B,8836,8836,36
TSG,THE SPOT GRILL,Toronto,97,14.0,14,A,A,9409,9409,196

### Lambdas with multiple columns as arguments

In [58]:
def mysum(a,b):
    return a+b

restaurants['newcolumn'] = restaurants.apply(lambda x: mysum(x['Score'], x['name_len']), axis=1)

restaurants

,Restaurant,Location,Score,name_len,name_len2,class1,class2,scoresq1,scoresq2,name_len2sq2,newcolumn
HCS,HABITAT COFFEE SHOP,Milan,95,19.0,19,B,B,9025,9025,361,114.0
RS,REILLY'S,Los Angeles,91,8.0,8,B,B,8281,8281,64,99.0
SC,STREET CHURROS,New York,90,14.0,14,B,B,8100,8100,196,104.0
RGC,RIO GENTLEMANS CLUB,Rome,96,19.0,19,A,A,9216,9216,361,115.0
LPQ,LE PAIN QUOTIDIEN,Berlin,89,17.0,17,B,B,7921,7921,289,106.0
TEP,TRINITI ECHO PARK,Madrid,99,17.0,17,A,A,9801,9801,289,116.0
MMM,MARCE'S MINI MARKET,Cape Town,93,19.0,19,B,B,8649,8649,361,112.0
P,POLLEN,Ottawa,94,6.0,6,B,B,8836,8836,36,100.0
TSG,THE SPOT GRILL,Toronto,97,14.0,14,A,A,9409,9409,196,111.0

In [67]:
### Lambdas returning multiple arguments
lambda x, y: (x+y, x-y)

restaurants[["sum","diff"]] = restaurants[["Score","name_len2"]].apply(lambda x: (x.iloc[0]+x.iloc[1], x.iloc[0]-x.iloc[1]), axis=1, result_type ='expand')
restaurants

,Restaurant,Location,Score,name_len,name_len2,class1,class2,scoresq1,scoresq2,name_len2sq2,newcolumn,sum,diff
HCS,HABITAT COFFEE SHOP,Milan,95,19.0,19,B,B,9025,9025,361,114.0,114,76
RS,REILLY'S,Los Angeles,91,8.0,8,B,B,8281,8281,64,99.0,99,83
SC,STREET CHURROS,New York,90,14.0,14,B,B,8100,8100,196,104.0,104,76
RGC,RIO GENTLEMANS CLUB,Rome,96,19.0,19,A,A,9216,9216,361,115.0,115,77
LPQ,LE PAIN QUOTIDIEN,Berlin,89,17.0,17,B,B,7921,7921,289,106.0,106,72
TEP,TRINITI ECHO PARK,Madrid,99,17.0,17,A,A,9801,9801,289,116.0,116,82
MMM,MARCE'S MINI MARKET,Cape Town,93,19.0,19,B,B,8649,8649,361,112.0,112,74
P,POLLEN,Ottawa,94,6.0,6,B,B,8836,8836,36,100.0,100,88
TSG,THE SPOT GRILL,Toronto,97,14.0,14,A,A,9409,9409,196,111.0,111,83

## MERGING

In [35]:
# First Dataset
restaurants = pd.read_csv("randomrestaurants.csv", sep = ";",index_col=0)
restaurants

              Restaurant     Location  Score
HCS  HABITAT COFFEE SHOP        Milan     95
RS              REILLY'S  Los Angeles     91
SC        STREET CHURROS     New York     90
RGC  RIO GENTLEMANS CLUB         Rome     96
LPQ    LE PAIN QUOTIDIEN       Berlin     89
TEP    TRINITI ECHO PARK       Madrid     99
MMM  MARCE'S MINI MARKET    Cape Town     93
P                 POLLEN       Ottawa     94
TSG       THE SPOT GRILL      Toronto     97

In [36]:
# Second Dataset
restaurants2 = pd.read_csv("randomrestaurants_2.csv", sep = ";",index_col=0) # Load a different source
restaurants2

              Restaurant  Patent
HCS  HABITAT COFFEE SHOP   62728
RS              REILLY'S   73839
STC       STREET CHURROS    8888
RT           RATATOUILLE    5567
FF         THE GENTLEMAN     555

In [37]:
#  We merge the two data frames by common index
pd.merge(restaurants,restaurants2 ,left_index=True,right_index=True)

            Restaurant_x     Location  Score         Restaurant_y  Patent
HCS  HABITAT COFFEE SHOP        Milan     95  HABITAT COFFEE SHOP   62728
RS              REILLY'S  Los Angeles     91             REILLY'S   73839

In [38]:
 # ..but we can do it by a different column
pd.merge(restaurants,restaurants2,left_on="Restaurant",right_on="Restaurant" )

            Restaurant     Location  Score  Patent
0  HABITAT COFFEE SHOP        Milan     95   62728
1             REILLY'S  Los Angeles     91   73839
2       STREET CHURROS     New York     90    8888

In [54]:
 # ..or multiple columns
pd.merge(restaurants,restaurants2, right_index=True, left_on=["Restaurant"] )

Empty DataFrame
Columns: [Restaurant, Restaurant_x, Location, Score, Restaurant_y, Patent]
Index: []

In [52]:
# we can prioritize one of the df to be merged
pd.merge(restaurants,restaurants2,left_on="Restaurant",right_on="Restaurant", how='outer' ) 
# Let's try how ='outer', how= 'left', how = 'right'

             Restaurant     Location  Score   Patent
0   HABITAT COFFEE SHOP        Milan   95.0  62728.0
1              REILLY'S  Los Angeles   91.0  73839.0
2        STREET CHURROS     New York   90.0   8888.0
3   RIO GENTLEMANS CLUB         Rome   96.0      NaN
4     LE PAIN QUOTIDIEN       Berlin   89.0      NaN
5     TRINITI ECHO PARK       Madrid   99.0      NaN
6   MARCE'S MINI MARKET    Cape Town   93.0      NaN
7                POLLEN       Ottawa   94.0      NaN
8        THE SPOT GRILL      Toronto   97.0      NaN
9           RATATOUILLE          NaN    NaN   5567.0
10        THE GENTLEMAN          NaN    NaN    555.0

![Join](join.jpg)

## Try by yourself

- Import the dataset iris as a DataFrame
- Add the columns names (sepal length, sepal width, petal length, petal width, type).
- Create a new column *ratio_length* that  contains the ratio between the sepal and petal length.
- Add  a new column  named target  with value 1  if the type is setosa and 0 otherwise.